[
  {
    "_id": "63581318d1dd774dd35736ec",
    "courses_id": 1,
    "picture": "https://image.shutterstock.com/image-photo/html-inscription-against-laptop-code-260nw-1851522412.jpg",
    "name": "HTML",
    "des": "Welcome to the world of code! Last year, millions of learners from our community started with HTML. Why? HTML is the skeleton of all web pages. It’s often the first language learned by developers, marketers, and designers and is core to front-end development work. If this is your first time touching code, we’re excited for what you’re about to create. So what exactly is HTML? HTML provides structure to the content appearing on a website, such as images, text, or videos."
  },
  {
    "_id": "63581318d8143fe7243828ba",
    "courses_id": 2,
    "picture": "https://cdn.mos.cms.futurecdn.net/Vp9WvV7YKdH4k8sKRePcE8-1200-80.jpg",
    "name": "CSS",
    "des": "You’ll find learning CSS essential in styling websites. Web developers use it to build on basic HTML and add personality to plain text pages. This course helps you expand your coding foundation and gives you CSS interactive practice to start adding colors and background images or editing layouts so you can create your very own, unique stylized web pages."
  },
  {
    "_id": "63581318fb8bc5de7922e637",
    "courses_id": 3,
    "picture": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT998V233uz_xAAm3Pj-yBC71HY-_9UGdogpA&usqp=CAU",
    "name": "BOOTSTRAP",
    "des": "If you want to quickly create a website without writing tons of CSS from scratch, then Bootstrap 4 might be the framework you’re looking for. In this course, you’ll see how Bootstrap makes it easy to layout and create interactive and responsive sites. You’ll learn about Bootstrap’s grid system to construct complex layouts. Then, you’ll style and populate your site using Bootstrap’s utility classes and components. With Bootstrap, HTML, some familiarity with CSS, and JavaScript, you’ll be making websites in no time."
  },
  {
    "_id": "63581318fb8bc5de7922e637",
    "courses_id": 4,
    "picture": "https://www.google.com/search?q=javascript+pic&tbm=isch&ved=2ahUKEwiDyISb3fv6AhXjiOYKHVnlDhIQ2-cCegQIABAA&oq=javas+pic&gs_lcp=CgNpbWcQARgAMgYIABAHEB4yBggAEAcQHjIGCAAQBxAeMgYIABAHEB4yCAgAEAgQBxAeMggIABAIEAcQHjIJCAAQgAQQChAYMgkIABCABBAKEBg6BAgjECc6BQgAEIAEOgYIABAIEB46CAgAEIAEELEDOgsIABCABBCxAxCDAToECAAQQ1CICVjFL2CtN2gAcAB4AIABvAGIAZgJkgEDMC43mAEAoAEBqgELZ3dzLXdpei1pbWfAAQE&sclient=img&ei=EgVYY4P3DOORmgfZyruQAQ&bih=625&biw=1366&rlz=1C1YTUH_enBD1011BD1011",
    "name": "JAVASCRIPT",
    "des": "About this course You interact with JavaScript code all the time — you just might not realize it. It powers dynamic behavior on websites  and plays an important role in many fields, like front- and back-end engineering, game and mobile development, virtual reality, and more. In this course, you’ll learn JavaScript fundamentals that will be helpful as you dive deeper into more advanced topics.Build core programming concepts. Learn object-oriented concepts. Read and write JavaScript syntax "
  },
  {
    "_id": "635813180f7c631729e9bf57",
    "courses_id": 5,
    "picture": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ6r4mNjQI0TPWgjSBNGXoFD_x0cKFXf1K65A&usqp=CAU",
    "name": "REACT.JS",
    "des": "React  is one of the most popular JavaScript libraries to develop powerful, interactive web applications. You’ll learn how to start with React and build up to dynamic user interfaces. You’ll work with React specific concepts like: JSX, components, state, props, hooks, and more. Take this course to gain an edge as a front-end or full-stack web developer. Understand key React concepts Use JSX, props, state, and more Work in React’s modular style"
  },
  {
    "_id": "635813180f7c631729e9bf58",
    "courses_id": 6,
    "picture": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT2NeIiuJpRGyhT3zR8Q2BTIPYuEfeYOQAgsw&usqp=CAU",
    "name": "NODE.JS",
    "des": "JavaScript is one of the most popular programming languages. The powerful Node.js runtime environment has been ranked the technology most commonly used by professional developers. Node.js is an event-driven JavaScript runtime. Node has myriad potential uses for JavaScript development including being a great environment for building efficient network applications.      "
  }
]
